#include <iostream>
#include <cstdlib>
#include <term.h>
#include <unistd.h>
#include <string>
#include <curses.h>
using namespace std;

int main() {
    char x;
    while(true){
    cout<<"\t\t\t-------------------------------------------------------"<<endl;
    cout<<"\t\t\t    ***       *         *      *      *   *   * * * *"<<endl<<
            "\t\t\t   *    *    * *       *      * *     *  *    *"<<endl<<
              "\t\t\t    *       *   *     *      *   *    * *     * * * *"<<endl<<
               "\t\t\t     *     *     *   *      * * * *   ** *    *"<<endl<<
            "\t\t\t *    *   *       * *      *       *  *   *   *"<<endl<<
             "\t\t\t  ****   *         *      *         * *   *   * * * *"<<endl;
    cout<<"\t\t\t-------------------------------------------------------"<<endl;
    cout<<"\t\t\t\t\t\tPress [K] to start..."<<endl;
    cout<<"\t\t\t\t\t\tPress [H] to learn more..."<<endl;
    cout<<"\t\t\t\t\t\tPress [U] to see us..."<<endl;
    cin>>x;
    cin.ignore();
        if(x=='k'){
            break;
        }
    if(x=='h'){
        cout<<"1ในเกมนี่จะมีผู้เล่น 2 คน"<<endl;
        cout<<"2.ให้แต่ละผู้เล่นทอยลูกเต๋า 1 ครั้งและเดินไปตามช่องเท่ากับแต้มที่ได้ โดยผู้เล่น1คนทอยลูกเต๋าได้เพียงครั้งเดียวต่อตานั้นๆ"<<endl;
        cout<<"3.เมื่อผู้เล่นเดินไปในช่องที่มีกับดักหรือสมบัติ ต้องปฏิบัติตามคำสั่งในช่องนั้นๆ"<<endl;
        cout<<"4.เมื่อมีผู้เล่นคนใดคนหนึ่งถึงเส้นชัยถือว่าเกมจบ ผู้เล่นที่เข้าเส้นชัยเป็นฝ่ายชนะ ผู้เล่นที่ไม่ได้เข้าเส้นชัยเป็นฝ่ายแพ้"<<endl;
        cout<<"5.เมื่อมีผู้เล่นคนใดคนหนึ่งเลือดหมดก่อนอีกคน ถือว่าผู้เล่นคนนั้นแพ้"<<endl;
        cout<<"6.ในเกมนี่จะมีการจับเวลา เมื่อเวลาหมดจะมีการตัดสินเกมจากแต้มรวมที่ผู้เล่นได้สะสมไว้ หากผู้เล่นใดมีแต้มเยอะที่สุดจะเป็นฝ่ายชนะ โดยพิจารณาแต้มตามเกณฑ์ดังนี้"<<endl;
        cout<<"\t 1) ผู้เล่นที่เลือดเยอะกว่าคนใดคนหนึ่งจะได้รับแต้มเพิ่มเป็น +2 point"<<endl;
        cout<<"\t 2) ผู้เล่นที่มีกับดักที่ยังคงส่งผลในตาล่าสุด แต้มของผู้เล่นจะถูกลดตามระดับความโชคร้ายของกับดัก"<<endl;
        cout<<"\t 3) ผู้เล่นที่มีสมบัติที่ยังคงส่งผลในตาล่าสุดหรือมีครอบครองไว้และยังไม่ได้ใช้ แต้มของผู้เล่นจะเพิ่มขึ้นตามระดับความโชคดีของสมบัติ"<<endl;
        cout<<"Press Button to comtinue....";
        cin.get();
        cin.ignore();
    }
    
    if(x=='u'){
        cout<<"1. Mr.Goravit Buakumpan        Id: 610610567"<<endl;
        cout<<"2. Ms.Kansiree Lee             Id: 610610568"<<endl;
        cout<<"3. Mr.Kittipong Milerue        Id: 610610570"<<endl;
        cout<<"4. Mr.Piampong Punroop        Id: 610610700"<<endl;
        cout<<"Press Button to comtinue....";
        cin.get();
        cin.ignore();
    }
    }
    return 0;
}